# 言語のランタイムなどは bin/develop.sh でインストール

# Setup tap
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Install CLI App
brew "ghq"
brew "git"
brew "gnupg"
brew "lazygit"
brew "neofetch"
brew "peco"
brew "pinentry-mac"
brew "starship"
brew "gh"
brew "yt-dlp"
brew "ffmpeg"
brew "tmux"
brew "gawk"
brew "coreutils"
brew "bat"
brew "onefetch"
brew "trivy"

# Install GUI App
cask "cleanshot"
cask "discord"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keybase"
cask "notion"
cask "postman"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
cask "clipy"
cask "prismlauncher"
cask "slack"

# Install AppStore App

brew "mas"

mas "BetterSnapTool", id: 417375580
mas "TickTick:To-Do List, Calendar", id: 966085870
mas "LINE", id: 539883307
mas "RunCat", id: 1429033973
mas "Amazon Prime Video", id: 545519333
