tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# 言語のランタイムなどは bin/develop.sh でインストール

brew "lazygit"
brew "neofetch"
brew "starship"
brew "gpg"
brew "peco"
brew "ghq"

cask "item2"
cask "notion"
cask "visual-studio-code"
cask "discord"
cask "keybase"
cask "postman"
cask "google-chrome"
cask "spotify"
cask "raycast"
cask "cleanshot"
cask "google-japanese-ime"
cask "jetbrains-toolbox"
